```
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.external.git: Refreshing state...
module.serverless-example-api.module.repository.github_repository.repository: Refreshing state... [id=serverless-example-api]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.aws_organization.aws_organizations_account.account will be created
  + resource "aws_organizations_account" "account" {
      + arn              = (known after apply)
      + email            = (known after apply)
      + id               = (known after apply)
      + joined_method    = (known after apply)
      + joined_timestamp = (known after apply)
      + name             = (known after apply)
      + parent_id        = (known after apply)
      + status           = (known after apply)
    }

  # module.aws_organization.random_string.random will be created
  + resource "random_string" "random" {
      + id          = (known after apply)
      + length      = 4
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

Plan: 2 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: planfile

To perform exactly these actions, run the following command to apply:
    terraform apply "planfile"

\n\n0
```